Практика1/src/Documents/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расход</name>
  <registerRecords>AccumulationRegister.МесячнаяДинамикаРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ЕжедневныеРасходы</registerRecords>
  <attributes>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасходов</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоПотратил</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Практика1/src/AccumulationRegisters/ЕжедневныеРасходы/ЕжедневныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЕжедневныеРасходы</name>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияРасходов</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникСемьи</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практика1/src/AccumulationRegisters/МесячнаяДинамикаРасходов/МесячнаяДинамикаРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МесячнаяДинамикаРасходов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияРасходов</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникСемьи</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практика1/src/Documents/Расход/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЕжедневныеРасходы Расход
	Движения.ЕжедневныеРасходы.Записывать = Истина;
	Движение = Движения.ЕжедневныеРасходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.КатегорияРасходов = КатегорияРасходов;
	Движение.УчастникСемьи = КтоПотратил;
	Движение.СуммаРасходов = Сумма;

	// регистр МесячнаяДинамикаРасходов 
	Движения.МесячнаяДинамикаРасходов.Записывать = Истина;
	Движение = Движения.МесячнаяДинамикаРасходов.Добавить();
	Движение.Период = Дата;
	Движение.КатегорияРасходов = КатегорияРасходов;
	Движение.УчастникСемьи = КтоПотратил;
	Движение.СуммаРасходов = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
